> a=[]
> a["4294967295"]=1
> print(a.length)
0
> a["4294967294"]=2
> print(a.length)
4294967295
> print(a["4294967295"])
2
> print(a["4294967294"])
1
